# coding=utf-8

import jqdatasdk as jq
import numpy as np
import pandas as pd
import os
import datetime


jq.auth('13482693726', '693726')
industies = [
['801013,801011,801012,801015', '农林渔'],
['801014,801016', '饲料种植'],
['801017,801018', '畜禽养殖'],
['801021', '煤炭开采'],
['801022,801023,801024', '采掘'],
['801032,801033,801034', '化学纤维原料'],	
['801035', '石油化工'],	
['801036,801037', '塑料橡胶'],
['801041', '钢铁'],	
['801051', '新材料'],
['801054,801053,801055', '工业稀有金属'],
['801072', '通用机械'],	
['801073', '仪器仪表'],	
['801074', '专用设备'],	
['801075', '金属制品'],	
['801076', '运输设备'],	
['801081', '半导体'],	
['801083,801082', '电子元件'],	
['801084', '光学光电子'],	
['801085', '电子制造'],	
['801093,801092', '汽车零部件服务'],	
['801094', '汽车整车'],	
['801101', '计算机设备'],	
['801102,801223', '通信'],	
['801111', '白色家电'],	
['801112', '视听器材'],	
['801123', '饮料制造'],	
['801132,801131', '纺织服装'],	
['801141', '包装印刷'],	
['801142,801144', '轻工'],	
['801143', '造纸'],	
['801151', '化学制药'],	
['801152', '生物制品'],	
['801153', '医疗器械'],	
['801154', '医药商业'],	
['801155', '中药'],	
['801156', '医疗服务'],	
['801161', '电力能源'],	
['801162', '环保'],	
['801163,801164', '燃气水务'],
['801171,801174', '港口机场'],
['801173,801175,801172,801177,801177', '公交航空高速'],	
['801176', '航运'],	
['801178', '物流'],	
['801181,801182', '房地产园区'],	
['801192,801194', '银行保险'],
['801193,801191', '证券金融'],	
['801202', '贸易'],	
['801203,801204', '零售'],	
['801205', '商业物业经营'],	
['801211,801212,801212,801214,801215', '餐饮景点酒店'],
['801222', '计算机应用'],
['801711,801712', '水泥玻璃'],	
['801713', '其他建材'],	
['801721', '房屋建设'],	
['801722', '装修装饰'],	
['801723', '基础建设'],	
['801724', '专业工程'],	
['801725', '园林工程'],	
['801731,801732', '电机电气设备'],
['801733,801734', '电源设备'],	
['801741,801742,801881', '航空航天交运装备'],
['801743', '地面兵装'],	
['801744', '船舶制造'],	
['801751,801761', '文化传播'],
['801231', '综合'],	]

# print(jq.get_industry_stocks('801062'))

file = 'data/jq-industries.csv'
with open(file, 'w', newline='\n', encoding="utf-8") as myfile:
    myfile.write('name:symbols\n')
    for industry in industies:
        stock_list = []
        for indust in industry[0].split(','):
            stock_list += jq.get_industry_stocks(indust)
        myfile.write(industry[1] + ':' + ','.join(stock_list) + '\n')
